tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "microsoft/mssql-release"
tap "warrensbox/tap"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Emacs dependency management
brew "cask"
# Statistics utility to count lines of code
brew "cloc"
# Modern replacement for 'ls'
brew "exa"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Mac App Store command-line interface
brew "mas"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader", args: { appdir: "/Applications" }
# Application uninstaller
cask "appcleaner", args: { appdir: "/Applications" }
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# App to build and share containerized applications and microservices
cask "docker", args: { appdir: "/Applications" }
# Online diagram software
cask "drawio", args: { appdir: "/Applications" }
# Client for the Dropbox cloud storage service
cask "dropbox", args: { appdir: "/Applications" }
# Web browser
cask "firefox", args: { appdir: "/Applications" }
cask "font-alegreya"
cask "font-alegreya-sans"
# Free and open-source image editor
cask "gimp", args: { appdir: "/Applications" }
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", args: { appdir: "/Applications" }
# End-to-end encryption software
cask "keybase", args: { appdir: "/Applications" }
# Open-source Markdown editor
cask "macdown", args: { appdir: "/Applications" }
# File system integration
cask "macfuse"
# Open-source, KeePass-client and password manager
cask "macpass", args: { appdir: "/Applications" }
# Web browser
cask "microsoft-edge", args: { appdir: "/Applications" }
# Note taking app
cask "nvalt", args: { appdir: "/Applications" }
# File system integration
cask "osxfuse", args: { appdir: "/Applications" }
# Music streaming service
cask "spotify", args: { appdir: "/Applications" }
# Unpacks archive files
cask "the-unarchiver", args: { appdir: "/Applications" }
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
# Multimedia player
cask "vlc", args: { appdir: "/Applications" }
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Horo", id: 1437226581
mas "iMovie", id: 408981434
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Loud Typer", id: 1493508558
mas "Microsoft Remote Desktop", id: 1295203466
mas "Moom", id: 419330170
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 1147396723
vscode "bmalehorn.vscode-fish"
vscode "davidmarek.jsonpath-extract"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "eriklynd.json-tools"
vscode "GrapeCity.gc-excelviewer"
vscode "lextudio.restructuredtext"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "nickdemayo.vscode-json-editor"
vscode "pdconsec.vscode-print"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-czech"
vscode "tamasfe.even-better-toml"

# Install these on home MacBook only
{{- if eq .machine "home" }}
mas "XCode", id: 497799835
vscode "PNDA.nml-language"
vscode "af4jm.vscode-icalendar"
{{- end }}


# Install these on work MacBook only
{{- if eq .machine "work" }}
brew "age"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Platform built on V8 to build network applications
brew "node"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Persistent key-value database, with built-in net interface
brew "redis"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Linter for Terraform files
brew "tflint"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# ODBC Driver for Microsoft(R) SQL Server(R)
# brew "microsoft/mssql-release/msodbcsql@13.1.9.2"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Data management tool that enables working with SQL Server
cask "azure-data-studio", args: { appdir: "/Applications" }
# Productivity platform for tasks, docs, goals, and chat
cask "clickup", args: { appdir: "/Applications" }
# Collaboration platform for API development
cask "postman", args: { appdir: "/Applications" }
# Team communication and collaboration software
cask "slack", args: { appdir: "/Applications" }
# Development environment
# cask "vagrant", args: { appdir: "/Applications" }
mas "Pluralsight", id: 431748264
vscode "ahmadalli.vscode-nginx-conf"
vscode "buianhthang.xml2json"
vscode "hashicorp.terraform"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.isort"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.azure-account"
vscode "quicktype.quicktype"
vscode "shakram02.bash-beautify"
vscode "Tyriar.sort-lines"
vscode "william-voyek.vscode-nginx"
vscode "WSO2.siddhi"
{{- end }}
